Tekla Open API Reference for Tekla Structures 2025
InvalidTypeException Constructor
 Creates a new InvalidTypeException instance.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public InvalidTypeException(
	string Message
)
Public Sub New (
	Message As String
)
Parameters
Message
Type: System.String
[Missing <param name="Message"/> documentation for "M:Tekla.Structures.Drawing.InvalidTypeException.#ctor(System.String)"]
See Also
Reference
InvalidTypeException Class
Tekla.Structures.Drawing Namespace